Статистика работы механизмов/Конфигурация/DataProcessors/_СверкаСоСпискомТеррористов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_СверкаСоСпискомТеррористов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыборочнаяПроверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроверяемыеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_СверкаСоСпискомТеррористов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ВыборочнаяПроверкаПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	Элементы.ПроверяемыеЛица.Доступность = Объект.ВыборочнаяПроверка;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьСверкуСоСпискомТеррористов(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОтчетОСверке = ВыполнитьСверкуСоСпискомТеррористовВMatrix();
	
	Если ОтчетОСверке = Неопределено Тогда
		ПоказатьПредупреждение(, "При выполнении сверки прозошли ошибки!");
		Возврат;	
	КонецЕсли;
	
	ОтчетОСверке.Показать("Результат сверки со списком террористов в Matrix");	
КонецПроцедуры

&НаСервере
Функция ВыполнитьСверкуСоСпискомТеррористовВMatrix()
	Перем ПроверяемыеЛица;	
	
	Если Объект.ВыборочнаяПроверка Тогда
		ПроверяемыеЛица = Объект.ПроверяемыеЛица.Выгрузить(, "ЮрФизЛицо").ВыгрузитьКолонку("ЮрФизЛицо"); 
	КонецЕсли;
	
	ОтчетОСверке = Новый ТабличныйДокумент;
	
	// Добавляем сбор статистики
	Механизм			= СтрЗаменить(ЭтаФорма.ИмяФормы, ".Форма.Форма", ".Форма") + ".ВыполнитьСверкуСоСпискомТеррористовВMatrix()";	
	ПараметрыВыполнения	= ПолучитьПараметрыВыполненияДляСбораСтатистики(ПроверяемыеЛица);
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполнения.Хранилище, ПараметрыВыполнения.Описание);
	
	// Выполняем сверку
	РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСпискомТеррористовВMatrix(ПроверяемыеЛица, , ОтчетОСверке);
	
	// Завершаем сессию сбора статистики
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия); 	
	
	Возврат ОтчетОСверке;
КонецФункции

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики(ПроверяемыеЛица)
	
	ПараметрыОтчета = Новый Соответствие();
	ПараметрыОтчета.Вставить("ВыборочнаяПроверка", Объект.ВыборочнаяПроверка);
	
	Если ЗначениеЗаполнено(ПроверяемыеЛица) Тогда
		ПараметрыОтчета.Вставить("ПроверяемыеЛица", ПроверяемыеЛица);
	КонецЕсли;
	
	Описание =
		"Выборочная проверка: " + ПараметрыОтчета["ВыборочнаяПроверка"] + "
		|Проверяемые лица: " + ?(ЗначениеЗаполнено(ПроверяемыеЛица), "Заданный список", "Полный список");
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики
